import random


word_list = ['бар', ',бариста', 'кофе', 'машина', 'молоть', 'лом', 'дверь', 'облако', 'копать', 'рубить', 'дерево', 'солнце', 'пароход', 'капсула', \
    'работа', 'утро', 'смена', 'коллега', 'молоко', 'кокос', 'холодильник', 'касса']


def get_word(word_list):
    return random.choice(word_list).upper()


print(get_word(word_list))


def display_hangman(tries):
    stages = [  # финальное состояние: голова, торс, обе руки, обе ноги
                '''
                   --------
                   |      |
                   |      O
                   |     \\|/
                   |      |
                   |     / \\
                   -
                ''',
                # голова, торс, обе руки, одна нога
                '''
                   --------
                   |      |
                   |      O
                   |     \\|/
                   |      |
                   |     / 
                   -
                ''',
                # голова, торс, обе руки
                '''
                   --------
                   |      |
                   |      O
                   |     \\|/
                   |      |
                   |      
                   -
                ''',
                # голова, торс и одна рука
                '''
                   --------
                   |      |
                   |      O
                   |     \\|
                   |      |
                   |     
                   -
                ''',
                # голова и торс
                '''
                   --------
                   |      |
                   |      O
                   |      |
                   |      |
                   |     
                   -
                ''',
                # голова
                '''
                   --------
                   |      |
                   |      O
                   |    
                   |      
                   |     
                   -
                ''',
                # начальное состояние
                '''
                   --------
                   |      |
                   |      
                   |    
                   |      
                   |     
                   -
                '''
    ]
    return stages[tries]


def play(word):
    print('Давайте играть в угадайку слов!')
    tries = 6

    print(display_hangman(tries))
    